trunk/service/InterfaceReservation_1/src/conf/xml-resources/web-service-references/Reservation/wsdl/Reservation.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="Reservation" targetNamespace="http://j2ee.netbeans.org/wsdl/mockReservation/Reservation"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/mockReservation/Reservation" xmlns:ns="http://xml.netbeans.org/schema/types" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/mockReservation/Reservation">
            <xsd:import namespace="http://xml.netbeans.org/schema/types" schemaLocation="types.xsd"/>
        </xsd:schema>
    </types>
    <message name="ReservationOperationRequest">
        <part name="ReservationRequest" type="ns:ReservationRequest"/>
    </message>
    <message name="ReservationOperationResponse">
        <part name="ReservationResponse" type="xsd:string"/>
    </message>
    <portType name="ReservationPortType">
        <operation name="ReservationOperation">
            <input name="input1" message="tns:ReservationOperationRequest"/>
            <output name="output1" message="tns:ReservationOperationResponse"/>
        </operation>
    </portType>
    <binding name="ReservationBinding" type="tns:ReservationPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ReservationOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/mockReservation/Reservation"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/mockReservation/Reservation"/>
            </output>
        </operation>
    </binding>
    <service name="ReservationService">
        <port name="ReservationPort" binding="tns:ReservationBinding">
            <soap:address location="http://localhost:18001/ReservationService"/>
        </port>
    </service>
    <plnk:partnerLinkType name="Reservation">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes.
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="ReservationPortTypeRole" portType="tns:ReservationPortType"/>
    </plnk:partnerLinkType>
</definitions>



